Assignments/Assignment_2/kelvin_to_fahrenheit_request.xml

<?xml version="1.0"?>

<soap:Envelope 
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope/" 
	soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding" >

	<soap:Header>
		<!-- placeholder -->
	</soap:Header>

	<soap:Body xmlns:conv="http://thewebsite.com/convert" >
		<conv:kelvinToFahrenheit>
			<conv:kelvin>10</conv:kelvin>
		</conv:kelvinToFahrenheit>
	  
	</soap:Body>

</soap:Envelope> 